# Ex - GroupBy

### Introduction:

GroupBy can be summarizes as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [6]:
drinks = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv")

### Step 3. Assign it to a variable called drinks.

In [9]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [29]:
most_beer = drinks.groupby("continent")["beer_servings"].mean().idxmax()
amount    = drinks.groupby("continent")["beer_servings"].mean()[most_beer]
print(f"The continent which drinks most beer on average is {most_beer} with {amount:.1f}")

The continent which drinks most beer on average is EU with 193.8

### Step 5. For each continent print the statistics for wine consumption.

In [36]:
drinks.groupby("continent")["wine_servings"].agg(['mean', 'std', 'min', 'max'])

                 mean        std  min  max
continent
AF          16.264151  38.846419    0  233
AS           9.068182  21.667034    0  123
EU         142.222222  97.421738    0  370
OC          35.625000  64.555790    0  212
SA          62.416667  88.620189    1  221

In [38]:
drinks[(drinks["continent"] == "EU") & (drinks["wine_servings"] == 0)]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
111,Monaco,0,0,0,0.0,EU
147,San Marino,0,0,0,0.0,EU

### Step 6. Print the mean alcoohol consumption per continent for every column

In [44]:
drinks.groupby("continent")[["beer_servings", "spirit_servings", "wine_servings", "total_litres_of_pure_alcohol"]].mean().sort_values(by="beer_servings", ascending=False)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
EU,193.777778,132.555556,142.222222,8.617778
SA,175.083333,114.750000,62.416667,6.308333
OC,89.687500,58.437500,35.625000,3.381250
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455

### Step 7. Print the median alcoohol consumption per continent for every column

In [45]:
drinks.groupby("continent")[["beer_servings", "spirit_servings", "wine_servings", "total_litres_of_pure_alcohol"]].median().sort_values(by="beer_servings", ascending=False)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
EU,219.0,122.0,128.0,10.00
SA,162.5,108.5,12.0,6.85
OC,52.5,37.0,8.5,1.75
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [51]:
spirit = drinks.groupby("continent")["spirit_servings"].agg(["mean", "min", "max"]).sort_values(by="mean", ascending=False)
spirit.head()

                 mean  min  max
continent
EU         132.555556    0  373
SA         114.750000   25  302
AS          60.840909    0  326
OC          58.437500    0  254
AF          16.339623    0  152